# St7SetPlateFill

Sets the fill colour scheme for plates.

Plate Entity Display

long St7SetPlateFill(long uID, long Fill)

Input Parameters

uID

Strand7 model file ID.

Fill

One of pfNone, pfProperty, pfGroup, pfColour, pfOrientation or pfContour.